//Спринт 3/22: Спринт 1 → Тема 2/5: Структуры и классы → Урок 1/11

/*Введение
Вы уже увидели, как создавать и менять контейнеры — строку, вектор, множество, словарь, пару. В этой теме вы разработаете свой тип данных «поисковая система» с соответствующим функционалом.
Типы без дополнительной логики называют структурами, а типы с методами — классами. Приятная особенность C++ в том, что все его встроенные типы кроме стандартных int, char, double, bool — это классы, реализованные на C++. Если научитесь писать собственные типы, лучше разберётесь в стандартных.
Как и функции, структуры и классы делают код более понятным. Его проще тестировать и переиспользовать. Разница в том, что функция — законченное действие с ясным входом и выходом, а класс и структура — это объекты. У объекта может быть дополнительная логика в виде методов.
Данная тема — первый шаг в изучении объектно-ориентированного программирования. Она затронет одно из главных понятий ООП — инкапсуляцию.*/