//Спринт 3/22: Спринт 1 → Тема 2/5: Структуры и классы → Урок 11/11

Заключение
В этой теме вы:
познакомились со структурами и классами;
поработали с методами.
В отличие от структуры, класс по умолчанию не даёт прямого доступа к своим полям. Это называется инкапсуляция.
В классе есть методы. Неконстантные методы позволяют изменить объект — например, добавить документ в поисковый индекс. Константные методы, как правило, возвращают некую информацию на основе данных объекта.
Статические методы класса не связаны с каким-либо объектом, и в них нельзя обращаться к данным класса и вызывать нестатические методы.